CheatSheet.org
#+Title: Tech Interview Study Sheet
#+Subtitle: A study guide for technical intervies.
#+Author: Daniel Rubinstein

#+Options: toc:nil num:nil
#+LaTeX_header: \usepackage{unicode}
#+Property: header-args :tangle yes

* Data Structures
** Arrays
Arrays store a collection of items in contiguous memory locations.
Normal arrays have a set length (as one must know how many consecutive memory spots must be allocated for the given array) although there are other methods by which one can increase the size of an array (See Doubling Arrays).
Some facts to know about the time complexity of array actions:
| Action                   | Worst Case | Best Case | Average Case |
|--------------------------+------------+-----------+--------------|
| Element Access           | O(1)       | O(1)      | O(1)         |
| Insert / Change / Delete | O(1)       | O(1)      | O(1)         |

Note:
- Insert is assumed to mean setting the initial value of a variable
- Delete is assumed to mean changing the value of an element to some temporary invalid value.
Other interpretations of inserting and deleting will have a varied time complexity.

** Doubling Arrays
This is simply an array that has a dynamic size. Once the array is filled, a new array of double the size is created and all the contents of the original array are copied over.

** Linked Lists
This recursively defined data structure stores a collection of objects (not necessarily in consecutive memory spots) by defining a node in the list as a structure holding some form of data as well as a pointer to the next node in the list.

Some useful information about the time complexity of various actions:
| Action                   | Worst Case | Best Case | Average Case |
|--------------------------+------------+-----------+--------------|
| Element Access           | O(N)       | -         | O(N/2)       |
| Insert / Change / Delete | O(N)       | -         | O(N/2)       |

** Doubly Linked Lists
These are simply linked lists that have pointers both to the next and previous node.

** Stacks
This data structure stores the pointer to a "stack of information" following the First in Last Out principle.
One can either pop or push from the stack.
- Pop allows one to take the top item off of the stack.
- Push allows one to put a new item onto the stack.

Implementations:
- Using arrays
  - Must track the top of the stack manually.
  - Can be fixed capacity.
- Using linked lists
  - Add / remove from the stack by insertin / deleting nodes.
  - No fixed capacity.
** Queues
This data structure works similarily to a line up of people at the grocery store.
Data is inserted and taken out using the First in First Out principle.
One can either enqueue or dequeue from the queue.
- Enqueue adds a new data item to the queue.
- Dequeue takes the "first in line" data item out of the queue.

Implementations:
- Array
- Linked list

** Sets / Bags
Sets are collections of unique items. Order is irellevant and so is multiplicity as only one copy of each item is stored.
A bag is similar to a set only multiplicity matters as multiple copies of each item can be stored.

** Priority Queues
Similar to queues only things are taken out based on their priority level (by maximum or minimum value) instead of the order they came in.
There are various implementations of such a data structure:

*** Unordered Arrays

The relevant time complexities are as follows:
| Action     | Time Complexity |
|------------+-----------------|
| Find Max   | O(N)            |
| Remove Max | O(N)            |
| Insert     | O(1)            |

*** Ordered Arrays

The relevant time complexities are as follows:
| Action     | Time Complexity |
|------------+-----------------|
| Find Max   | O(1)            |
| Remove Max | O(1)            |
| Insert     | O(N)            |

*** Binary Heaps
What is a heap?
A heap is a structure such similar to a binary tree such that both children have values less than their parent.
Properties (given that an array (id) stores the nodes in the heap):
- Children of id[x] are found at indexes 2*x and 2*x + 1
- The height of the heap is LogN

There are two actions that are used to construct and manipulate heaps:
- Sink takes a node and moves it lower into the tree until heap condition is satisfied.
- Swim takes a node and moves it higher in the tree until heap condition is satisfied.

How to do the three main PQ actions:
- Find max: Simply look at the root.
- Remove max: Swap the root with the last leaf node, remove it, and sink the new root.
- Insert: Add a new leaf node, swim it up.

The relevant time complexities are as follows:
| Action     | Time Complexity |
|------------+-----------------|
| Find Max   | O(1)            |
| Remove Max | O(LogN)         |
| Insert     | O(LogN)         |

*** D-Ary Heaps
Work just like binary heaps, only these have d children.
Binary heaps have time complexities of O(LogN), d-ary heaps have time complexities of O(cLog(base c)N)where c is the number of children that can exist in the d-ary heap.

** Trees
*** Binary Tree
A tree with 2 children
*** Complete Binary Tree
A tree such that all levels are completely filled.
*** Binary Search Tree
Useful for representing symbol tables.
Properties:
- Left child is smaller than parent
- Right child is greater than parent

For a symbol table represented as BST the relevant time complexities are:
| Action          | Time Complexity |
|-----------------+-----------------|
| Search Garuntee | O(N)            |
| Search Average  | O(logN)         |
| Insert Garuntee | O(N)            |
| Insert Average  | O(logN)         |


How do we tackle deletion?
- Tombstone method - Make some nodes "removed" or tombstone nodes
- Hibbard deletion - Based on the case, find a way to delete the node and rebuild the rest of the tree.

Problem is that tree shape can vary
How do we fix this problem?
- Balanced Search Trees

*** Balanced Search Trees
We can improve the balance of a BST by using various balancing techniques.
One such technique is to implement a 2-3 tree.
This tree has nodes that are either:
- 2 Nodes: 1 Key, 2 Children
- 3 Nodes: 2 Keys, 3 Children

Actions for such a tree include:
- Search: Done like a BST based on the values of the nodes.
- Insert into 2 Node: Transform the node into a 3 Node
- Insert into 3 Node: Transform the node into a temporary 4 Node, then move the middle key up and restructure the tree.

How can we represent such a tree?
- As a BST? No
- As a BST with glue nodes? Yes but this is tedious.
- As a Red Black Tree? Perfect!

The relevant time complexities for this structure are:
| Action          | Time Complexity  |
|-----------------+------------------|
| Search Garuntee | O(CLog(base C)N) |
| Search Average  | O(CLog(base C)N) |
| Insert Garuntee | O(CLog(base C)N) |
| Insert Average  | O(CLog(base C)N) |
Where C is dependant on the types of nodes in the tree.

