CheatSheet.tex
% Created 2019-12-16 Mon 00:52
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{unicode}
\author{Daniel Rubinstein}
\date{\today}
\title{Tech Interview Study Sheet\\\medskip
\large A study guide for technical intervies.}
\hypersetup{
 pdfauthor={Daniel Rubinstein},
 pdftitle={Tech Interview Study Sheet},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{Data Structures}
\label{sec:orgf7796ff}
\subsection*{Arrays}
\label{sec:orge60915a}
Arrays store a collection of items in contiguous memory locations.
Normal arrays have a set length (as one must know how many consecutive memory spots must be allocated for the given array) although there are other methods by which one can increase the size of an array (See Doubling Arrays).
Some facts to know about the time complexity of array actions:
\begin{center}
\begin{tabular}{llll}
Action & Worst Case & Best Case & Average Case\\
\hline
Element Access & O(1) & O(1) & O(1)\\
Insert / Change / Delete & O(1) & O(1) & O(1)\\
\end{tabular}
\end{center}

Note:
\begin{itemize}
\item Insert is assumed to mean setting the initial value of a variable
\item Delete is assumed to mean changing the value of an element to some temporary invalid value.
\end{itemize}
Other interpretations of inserting and deleting will have a varied time complexity.

\subsection*{Doubling Arrays}
\label{sec:org120b56d}
This is simply an array that has a dynamic size. Once the array is filled, a new array of double the size is created and all the contents of the original array are copied over.

\subsection*{Linked Lists}
\label{sec:orgbb772e3}
This recursively defined data structure stores a collection of objects (not necessarily in consecutive memory spots) by defining a node in the list as a structure holding some form of data as well as a pointer to the next node in the list.

Some useful information about the time complexity of various actions:
\begin{center}
\begin{tabular}{llll}
Action & Worst Case & Best Case & Average Case\\
\hline
Element Access & O(N) & - & O(N/2)\\
Insert / Change / Delete & O(N) & - & O(N/2)\\
\end{tabular}
\end{center}

\subsection*{Doubly Linked Lists}
\label{sec:org3d42140}
These are simply linked lists that have pointers both to the next and previous node.

\subsection*{Stacks}
\label{sec:org25d8bcb}
This data structure stores the pointer to a "stack of information" following the First in Last Out principle.
One can either pop or push from the stack.
\begin{itemize}
\item Pop allows one to take the top item off of the stack.
\item Push allows one to put a new item onto the stack.
\end{itemize}

Implementations:
\begin{itemize}
\item Using arrays
\begin{itemize}
\item Must track the top of the stack manually.
\item Can be fixed capacity.
\end{itemize}
\item Using linked lists
\begin{itemize}
\item Add / remove from the stack by insertin / deleting nodes.
\item No fixed capacity.
\end{itemize}
\end{itemize}
\subsection*{Queues}
\label{sec:org72db4d0}
This data structure works similarily to a line up of people at the grocery store.
Data is inserted and taken out using the First in First Out principle.
One can either enqueue or dequeue from the queue.
\begin{itemize}
\item Enqueue adds a new data item to the queue.
\item Dequeue takes the "first in line" data item out of the queue.
\end{itemize}

Implementations:
\begin{itemize}
\item Array
\item Linked list
\end{itemize}

\subsection*{Sets / Bags}
\label{sec:org2b4bd11}
Sets are collections of unique items. Order is irellevant and so is multiplicity as only one copy of each item is stored.
A bag is similar to a set only multiplicity matters as multiple copies of each item can be stored.

\subsection*{Priority Queues}
\label{sec:org4445f8a}
Similar to queues only things are taken out based on their priority level (by maximum or minimum value) instead of the order they came in.
There are various implementations of such a data structure:

\subsubsection*{Unordered Arrays}
\label{sec:org90fde00}

The relevant time complexities are as follows:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Find Max & O(N)\\
Remove Max & O(N)\\
Insert & O(1)\\
\end{tabular}
\end{center}

\subsubsection*{Ordered Arrays}
\label{sec:orgca496ca}

The relevant time complexities are as follows:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Find Max & O(1)\\
Remove Max & O(1)\\
Insert & O(N)\\
\end{tabular}
\end{center}

\subsubsection*{Binary Heaps}
\label{sec:org0104ed6}
What is a heap?
A heap is a structure such similar to a binary tree such that both children have values less than their parent.
Properties (given that an array (id) stores the nodes in the heap):
\begin{itemize}
\item Children of id[x] are found at indexes 2*x and 2*x + 1
\item The height of the heap is LogN
\end{itemize}

There are two actions that are used to construct and manipulate heaps:
\begin{itemize}
\item Sink takes a node and moves it lower into the tree until heap condition is satisfied.
\item Swim takes a node and moves it higher in the tree until heap condition is satisfied.
\end{itemize}

How to do the three main PQ actions:
\begin{itemize}
\item Find max: Simply look at the root.
\item Remove max: Swap the root with the last leaf node, remove it, and sink the new root.
\item Insert: Add a new leaf node, swim it up.
\end{itemize}

The relevant time complexities are as follows:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Find Max & O(1)\\
Remove Max & O(LogN)\\
Insert & O(LogN)\\
\end{tabular}
\end{center}

\subsubsection*{D-Ary Heaps}
\label{sec:org2869a83}
Work just like binary heaps, only these have d children.
Binary heaps have time complexities of O(LogN), d-ary heaps have time complexities of O(cLog(base c)N)where c is the number of children that can exist in the d-ary heap.

\subsection*{Trees}
\label{sec:orga08ca38}
\subsubsection*{Binary Tree}
\label{sec:orgb57e5eb}
A tree with 2 children
\subsubsection*{Complete Binary Tree}
\label{sec:org098d583}
A tree such that all levels are completely filled.
\subsubsection*{Binary Search Tree}
\label{sec:org017f619}
Useful for representing symbol tables.
Properties:
\begin{itemize}
\item Left child is smaller than parent
\item Right child is greater than parent
\end{itemize}

For a symbol table represented as BST the relevant time complexities are:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Search Garuntee & O(N)\\
Search Average & O(logN)\\
Insert Garuntee & O(N)\\
Insert Average & O(logN)\\
\end{tabular}
\end{center}


How do we tackle deletion?
\begin{itemize}
\item Tombstone method - Make some nodes "removed" or tombstone nodes
\item Hibbard deletion - Based on the case, find a way to delete the node and rebuild the rest of the tree.
\end{itemize}

Problem is that tree shape can vary
How do we fix this problem?
\begin{itemize}
\item Balanced Search Trees
\end{itemize}

\subsubsection*{Balanced Search Trees}
\label{sec:orgb87c72e}
We can improve the balance of a BST by using various balancing techniques.
One such technique is to implement a 2-3 tree.
This tree has nodes that are either:
\begin{itemize}
\item 2 Nodes: 1 Key, 2 Children
\item 3 Nodes: 2 Keys, 3 Children
\end{itemize}

Actions for such a tree include:
\begin{itemize}
\item Search: Done like a BST based on the values of the nodes.
\item Insert into 2 Node: Transform the node into a 3 Node
\item Insert into 3 Node: Transform the node into a temporary 4 Node, then move the middle key up and restructure the tree.
\end{itemize}

How can we represent such a tree?
\begin{itemize}
\item As a BST? No
\item As a BST with glue nodes? Yes but this is tedious.
\item As a Red Black Tree? Perfect!
\end{itemize}

The relevant time complexities for this structure are:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Search Garuntee & O(CLog(base C)N)\\
Search Average & O(CLog(base C)N)\\
Insert Garuntee & O(CLog(base C)N)\\
Insert Average & O(CLog(base C)N)\\
\end{tabular}
\end{center}
Where C is dependant on the types of nodes in the tree.
