CheatSheet.org
*** Red Black Trees
This is a BST that now has a colour value attached to it's various node connections.
There are a few properties that always hold:
- No nodes can have 2 red connections going into / out of them.
- Every path from the root to a leaf has an equal number of black connections.
- Every red connection is left leaning
Red connections signify 3-nodes from Balanced Search Trees above.

There are three actions that are useful to know for constructing such a tree:
- Rotate left
- Rotate right
- Change colours

The relevant time complexities for this structure are:
| Action          | Time Complexity |
|-----------------+-----------------|
| Search Garuntee | O(LogN)         |
| Search Average  | O(LogN)         |
| Insert Garuntee | O(LogN)         |
| Insert Average  | O(LogN)         |

*** B-Trees
TLDR: Like 2-3 trees, only they can store a variable amount of keys in each node. 
I'll add more on this later.

*** Hash Tables
Used for symbol table implementation. Determines where to store info based on a hash function.
Hash function determines the memory location where the data is to be stored.


We run into an issue: What happens if we continually hash to the same place?
- Solution 1: Seperate Chaining
  - Store linked lists of data at each hash location. Then you only have to search through the linked list to find the data.
    - On average given M locations to hash to, and N values, it takes O(M/N) to find a data segment.
- Solution 2: Linear Probing
  - If the hash location is currently occupied, find the next available location to hash to.
    - Another problem: This gets worse the more we hash to the same location (i.e. problem called clustering)

Other improvements:
- Double probing: Hash to two different locations, place data into the open one
- Double hashing - Instead of finding the next available memory location like in linear probing, skip a variable amount of memory blocks and try there.
- Cuckoo hashing - Hash to two locations, reinsert some of the data there if both are filled. (I'll add more on this later). 
*** Graph
A series of vertices connected (possibly) by edges.
Graph Terminolog:
- Path - A set of connections between two vertices.
- Cycle - A path that loops.

Possible representations:
- Adjacency matrix - 2D matrix with booleans to explain if two vertices are connected.
- Adjacency lists - Series of linked lists stored in an array to describe which vertices are connected.

DFS:
- Depth first search.
- See implementation examples to be uploaded soon.
- Can be used to solve connectivity problem.
- Can be used to find cycles within DAGs.
BFS:
- Breadth first search
- See implementation examples to be uploaded soon.

Undirected vs Directed:
- Undirected has no direction to the edges in the graph.
- Directed graphs have edges with a direction.

Strongly Connected Components:
- V and W are strongly connected if there is a path from V to W and a path from W to V.
- Strong component is maximal subset of strongly connected vertices.

*** Edge Weighted Graphs
These are trees with weights given to each edge.
It brings up the interesting idea of finding shortest paths and minimum spanning tree.

**** MST
A minimum spanning tree (MST) is a tree that:
- Is connected (Has all vertices connected)
- Is acyclic
- Includes all vertices

The greedy logic behind calculating the tree revolves around making cuts. The general logic states:
Given any two sets of unconnected vertices ("cut" sets), the minimum edge that connects them is in the MST.

To formalize this we have two different algorithms: Kruskall's and Prims

Kruskall's algorithm works as follows:
- Continually add the minimum weight edge if it makes no cycles in the MST.
This is difficult to do as determining if a cut makes a cycle is difficult.

Prim's (Lazy Approach)
- Use a minimum PQ that stores every edge weight that connects a vertice W (not in the MST) to the MST.
- Remove the minimum edge from the PQ and add that to the MST (if it is still a valid edge to add).
- Update the PQ with new edges that are available that fit the desired conditions above.
The problem with this is that our PQ is not efficient. We store tons of edges that eventually become invalid.

Prim's (Eager approach)
- Use a minimum PQ that stores only one edge weight for every vertice W (not in the MST) that can be connected to the MST.
- Remove the minimum edgr from the PQ and add that to the MST.
- Update the PQ with new edges that are available that add new possible vertices to connect to, lower the weight to add any given vertices, etc.
More efficient with our memory, but a bit harder to keep track of.

**** Shortest Path
This section will be refined later. For now, here's the two algorithms I know for shortest path problems:

Djikstra:
- Consider vertices in increasing order of distance from the origin point.
- Relax edges as you go.
Works well if there's no cycles and no negatives.

Bellman-Ford:
- Initialize distance to origin as 0 and infinite for every other vertice.
- Go through the list of vertices V-1 times and relax every distance possible.

More to be added later.
* Algorithms

** Searching
*** Binary Search
TODO
** Sorting
*** Selection Sort
Selection sort works by:
- Iterate through the list with a counter c
- Find the minimum value in any index >= c
- Swap the minimum value with the value at c
- Increase c

The time complexity is as follows:
| Worst Case | Average Case | Best Case |
|------------+--------------+-----------|
| O(N^2)     | O(N^2)       | O(N^2)    |

*** Insertion Sort
Insertion sort works by:
- Iterate through the list with counter c
- Swap the element at c with the item to it's left until it is in it's sorted position
- Increase c.

The time complexity is as follows:
| Worst Case | Average Case | Best Case |
|------------+--------------+-----------|
| O(N^2)     | O(N^2)       | O(N)      |

*** Shell Sort
TODO
*** Merge Sort
This sorting algorithm works by:
- Splitting the array in half recursively until it can no longer be split
- Building up an array out of the split pieces in sorted order.

The time complexity is as follows:
| Worst Case | Average Case | Best Case |
|------------+--------------+-----------|
| O(NLogN)   | O(NLogN)     | O(NLogN)  |
*** Quick Sort
This sorting algorithm works by:
- Picking a pivot point
- Rearanging the list such that the pivot is placed in it's sorted position
  - Meaning everything to the left is < the pivot, everything to the right is > the pivot.
- Recursing on the left and right sub-arrays

The time complexity is as follows:
| Worst Case | Average Case | Best Case |
|------------+--------------+-----------|
| O(N^2)     | O(NLogN)     | O(NLogN)  |

Some improvements:
- 3-way Partitioning improves quick sort with duplicate values.
- Applying insertion sort on smaller sub-arrays can also work well.

