CheatSheet.tex

\subsubsection*{Red Black Trees}
\label{sec:org66b0bed}
This is a BST that now has a colour value attached to it's various node connections.
There are a few properties that always hold:
\begin{itemize}
\item No nodes can have 2 red connections going into / out of them.
\item Every path from the root to a leaf has an equal number of black connections.
\item Every red connection is left leaning
\end{itemize}
Red connections signify 3-nodes from Balanced Search Trees above.

There are three actions that are useful to know for constructing such a tree:
\begin{itemize}
\item Rotate left
\item Rotate right
\item Change colours
\end{itemize}

The relevant time complexities for this structure are:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Search Garuntee & O(LogN)\\
Search Average & O(LogN)\\
Insert Garuntee & O(LogN)\\
Insert Average & O(LogN)\\
\end{tabular}
\end{center}

\subsubsection*{B-Trees}
\label{sec:orgaf9e60a}
TLDR: Like 2-3 trees, only they can store a variable amount of keys in each node. 
I'll add more on this later.

\subsubsection*{Hash Tables}
\label{sec:orgd31c523}
Used for symbol table implementation. Determines where to store info based on a hash function.
Hash function determines the memory location where the data is to be stored.


We run into an issue: What happens if we continually hash to the same place?
\begin{itemize}
\item Solution 1: Seperate Chaining
\begin{itemize}
\item Store linked lists of data at each hash location. Then you only have to search through the linked list to find the data.
\begin{itemize}
\item On average given M locations to hash to, and N values, it takes O(M/N) to find a data segment.
\end{itemize}
\end{itemize}
\item Solution 2: Linear Probing
\begin{itemize}
\item If the hash location is currently occupied, find the next available location to hash to.
\begin{itemize}
\item Another problem: This gets worse the more we hash to the same location (i.e. problem called clustering)
\end{itemize}
\end{itemize}
\end{itemize}

Other improvements:
\begin{itemize}
\item Double probing: Hash to two different locations, place data into the open one
\item Double hashing - Instead of finding the next available memory location like in linear probing, skip a variable amount of memory blocks and try there.
\item Cuckoo hashing - Hash to two locations, reinsert some of the data there if both are filled. (I'll add more on this later).
\end{itemize}
\subsubsection*{Graph}
\label{sec:org9874c28}
A series of vertices connected (possibly) by edges.
Graph Terminolog:
\begin{itemize}
\item Path - A set of connections between two vertices.
\item Cycle - A path that loops.
\end{itemize}

Possible representations:
\begin{itemize}
\item Adjacency matrix - 2D matrix with booleans to explain if two vertices are connected.
\item Adjacency lists - Series of linked lists stored in an array to describe which vertices are connected.
\end{itemize}

DFS:
\begin{itemize}
\item Depth first search.
\item See implementation examples to be uploaded soon.
\item Can be used to solve connectivity problem.
\item Can be used to find cycles within DAGs.
\end{itemize}
BFS:
\begin{itemize}
\item Breadth first search
\item See implementation examples to be uploaded soon.
\end{itemize}

Undirected vs Directed:
\begin{itemize}
\item Undirected has no direction to the edges in the graph.
\item Directed graphs have edges with a direction.
\end{itemize}

Strongly Connected Components:
\begin{itemize}
\item V and W are strongly connected if there is a path from V to W and a path from W to V.
\item Strong component is maximal subset of strongly connected vertices.
\end{itemize}

\subsubsection*{Edge Weighted Graphs}
\label{sec:orgf13f43a}
These are trees with weights given to each edge.
It brings up the interesting idea of finding shortest paths and minimum spanning tree.

\begin{itemize}
\item MST
\label{sec:org83d469b}
A minimum spanning tree (MST) is a tree that:
\begin{itemize}
\item Is connected (Has all vertices connected)
\item Is acyclic
\item Includes all vertices
\end{itemize}

The greedy logic behind calculating the tree revolves around making cuts. The general logic states:
Given any two sets of unconnected vertices ("cut" sets), the minimum edge that connects them is in the MST.

To formalize this we have two different algorithms: Kruskall's and Prims

Kruskall's algorithm works as follows:
\begin{itemize}
\item Continually add the minimum weight edge if it makes no cycles in the MST.
\end{itemize}
This is difficult to do as determining if a cut makes a cycle is difficult.

Prim's (Lazy Approach)
\begin{itemize}
\item Use a minimum PQ that stores every edge weight that connects a vertice W (not in the MST) to the MST.
\item Remove the minimum edge from the PQ and add that to the MST (if it is still a valid edge to add).
\item Update the PQ with new edges that are available that fit the desired conditions above.
\end{itemize}
The problem with this is that our PQ is not efficient. We store tons of edges that eventually become invalid.

Prim's (Eager approach)
\begin{itemize}
\item Use a minimum PQ that stores only one edge weight for every vertice W (not in the MST) that can be connected to the MST.
\item Remove the minimum edgr from the PQ and add that to the MST.
\item Update the PQ with new edges that are available that add new possible vertices to connect to, lower the weight to add any given vertices, etc.
\end{itemize}
More efficient with our memory, but a bit harder to keep track of.

\item Shortest Path
\label{sec:orgdef6bfc}
This section will be refined later. For now, here's the two algorithms I know for shortest path problems:

Djikstra:
\begin{itemize}
\item Consider vertices in increasing order of distance from the origin point.
\item Relax edges as you go.
\end{itemize}
Works well if there's no cycles and no negatives.

Bellman-Ford:
\begin{itemize}
\item Initialize distance to origin as 0 and infinite for every other vertice.
\item Go through the list of vertices V-1 times and relax every distance possible.
\end{itemize}

More to be added later.
\end{itemize}
\section*{Algorithms}
\label{sec:orgf5debf9}

\subsection*{Searching}
\label{sec:org98eab77}
\subsubsection*{Binary Search}
\label{sec:org9b5879a}
TODO
\subsection*{Sorting}
\label{sec:orgb3bdf9f}
\subsubsection*{Selection Sort}
\label{sec:org1e5d698}
Selection sort works by:
\begin{itemize}
\item Iterate through the list with a counter c
\item Find the minimum value in any index >= c
\item Swap the minimum value with the value at c
\item Increase c
\end{itemize}

The time complexity is as follows:
\begin{center}
\begin{tabular}{lll}
Worst Case & Average Case & Best Case\\
\hline
O(N\textsuperscript{2}) & O(N\textsuperscript{2}) & O(N\textsuperscript{2})\\
\end{tabular}
\end{center}

\subsubsection*{Insertion Sort}
\label{sec:org630150e}
Insertion sort works by:
\begin{itemize}
\item Iterate through the list with counter c
\item Swap the element at c with the item to it's left until it is in it's sorted position
\item Increase c.
\end{itemize}

The time complexity is as follows:
\begin{center}
\begin{tabular}{lll}
Worst Case & Average Case & Best Case\\
\hline
O(N\textsuperscript{2}) & O(N\textsuperscript{2}) & O(N)\\
\end{tabular}
\end{center}

\subsubsection*{Shell Sort}
\label{sec:org491df6f}
TODO
\subsubsection*{Merge Sort}
\label{sec:orgfc61507}
This sorting algorithm works by:
\begin{itemize}
\item Splitting the array in half recursively until it can no longer be split
\item Building up an array out of the split pieces in sorted order.
\end{itemize}

The time complexity is as follows:
\begin{center}
\begin{tabular}{lll}
Worst Case & Average Case & Best Case\\
\hline
O(NLogN) & O(NLogN) & O(NLogN)\\
\end{tabular}
\end{center}
\subsubsection*{Quick Sort}
\label{sec:org59f08ca}
This sorting algorithm works by:
\begin{itemize}
\item Picking a pivot point
\item Rearanging the list such that the pivot is placed in it's sorted position
\begin{itemize}
\item Meaning everything to the left is < the pivot, everything to the right is > the pivot.
\end{itemize}
\item Recursing on the left and right sub-arrays
\end{itemize}

The time complexity is as follows:
\begin{center}
\begin{tabular}{lll}
Worst Case & Average Case & Best Case\\
\hline
O(N\textsuperscript{2}) & O(NLogN) & O(NLogN)\\
\end{tabular}
\end{center}

Some improvements:
\begin{itemize}
\item 3-way Partitioning improves quick sort with duplicate values.
\item Applying insertion sort on smaller sub-arrays can also work well.
\end{itemize}
