CheatSheet.org
*** Heap Sort
Heap sort works on a heapified array by:
- Remove the maximum value by swapping it with the last leaf node, removing the value, and swimming the new root down.

The relevant time complexities are as follows:
| Worst Case | Average Case | Best Case |
|------------+--------------+-----------|
| O(LogN)    | O(LogN)      | O(LogN)   |
*** Topological Sort
Used on Directed Acyclic Graphs.
Good for dependency problems.
Topological sort returns a sorted list by:
- Run DFS on all vertices (using some way to track which vertices are visited)
- Return reverse order of visited points.

Multiple possible topological sort results can be valid.


** Union Find Problem
The union find problem begs the question of how nodes are connected within a graph like strucutre.
There are three primary operations that are of interest when it comes to algorithms that solve this problem:
- Are two nodes connected?
- What connected component is a node in?
- How do we connect two nodes?

*** Quick-Find
Given an array (id) of N objects we chose to state that the value at id[x] is the id of the component that node x is in.

The time complexity for the three main actions are as follows:
| Action     | Time Complexity |
|------------+-----------------|
| Connected? | O(1)            |
| Find?      | O(1)            |
| Union?     | O(N)            |
*** Quick-Union
Given an array (id) of N elements. We state that id[x] is the parent of node x (almost like building a little tree).

The time complexity for the three main actions are as follows:
| Action     | Time Complexity |
|------------+-----------------|
| Connected? | O(N)            |
| Find?      | O(N)            |
| Union?     | O(N)            |

Some improvements to this could be:
- Weighting
  - Put smaller trees as children of larger trees.
  - This garuntees a height of LogN thus making O(lgN) time complexity on all actions.
- Path compression
  - As one traverses the tree, move children up in the hierarchy to create shorter paths to traverse from the parent to the leaf node.


* Language Knowledge
