CheatSheet.tex

\subsubsection*{Heap Sort}
\label{sec:org3f49981}
Heap sort works on a heapified array by:
\begin{itemize}
\item Remove the maximum value by swapping it with the last leaf node, removing the value, and swimming the new root down.
\end{itemize}

The relevant time complexities are as follows:
\begin{center}
\begin{tabular}{lll}
Worst Case & Average Case & Best Case\\
\hline
O(LogN) & O(LogN) & O(LogN)\\
\end{tabular}
\end{center}
\subsubsection*{Topological Sort}
\label{sec:org9193058}
Used on Directed Acyclic Graphs.
Good for dependency problems.
Topological sort returns a sorted list by:
\begin{itemize}
\item Run DFS on all vertices (using some way to track which vertices are visited)
\item Return reverse order of visited points.
\end{itemize}

Multiple possible topological sort results can be valid.


\subsection*{Union Find Problem}
\label{sec:org8e18f55}
The union find problem begs the question of how nodes are connected within a graph like strucutre.
There are three primary operations that are of interest when it comes to algorithms that solve this problem:
\begin{itemize}
\item Are two nodes connected?
\item What connected component is a node in?
\item How do we connect two nodes?
\end{itemize}

\subsubsection*{Quick-Find}
\label{sec:orga2ee200}
Given an array (id) of N objects we chose to state that the value at id[x] is the id of the component that node x is in.

The time complexity for the three main actions are as follows:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Connected? & O(1)\\
Find? & O(1)\\
Union? & O(N)\\
\end{tabular}
\end{center}
\subsubsection*{Quick-Union}
\label{sec:orgb50ecc8}
Given an array (id) of N elements. We state that id[x] is the parent of node x (almost like building a little tree).

The time complexity for the three main actions are as follows:
\begin{center}
\begin{tabular}{ll}
Action & Time Complexity\\
\hline
Connected? & O(N)\\
Find? & O(N)\\
Union? & O(N)\\
\end{tabular}
\end{center}

Some improvements to this could be:
\begin{itemize}
\item Weighting
\begin{itemize}
\item Put smaller trees as children of larger trees.
\item This garuntees a height of LogN thus making O(lgN) time complexity on all actions.
\end{itemize}
\item Path compression
\begin{itemize}
\item As one traverses the tree, move children up in the hierarchy to create shorter paths to traverse from the parent to the leaf node.
\end{itemize}
\end{itemize}


\section*{Language Knowledge}
\label{sec:org348267a}
\end{document}
